In [1]:
import pandas as pd

In [2]:
names=["kriti","annaya","anushka","krina"]
names

['kriti', 'annaya', 'anushka', 'krina']

In [3]:
marks=[78,76,89,47]
marks

[78, 76, 89, 47]

In [5]:
df=pd.Series(data=marks)
df

0    78
1    76
2    89
3    47
dtype: int64

In [6]:
type(df)

pandas.core.series.Series

In [7]:
df=pd.Series(data=names)
df

0      kriti
1     annaya
2    anushka
3      krina
dtype: object

In [8]:
student={"name":names,"mark":marks}
student

{'name': ['kriti', 'annaya', 'anushka', 'krina'], 'mark': [78, 76, 89, 47]}

In [9]:
type(student)

dict

In [10]:
df=pd.DataFrame(data=student)
df

      name  mark
0    kriti    78
1   annaya    76
2  anushka    89
3    krina    47

In [11]:
df=pd.DataFrame(data=student,index=["A","B","C","D"])
df

      name  mark
A    kriti    78
B   annaya    76
C  anushka    89
D    krina    47

In [12]:
df.shape

(4, 2)

In [13]:
df.info

<bound method DataFrame.info of       name  mark
A    kriti    78
B   annaya    76
C  anushka    89
D    krina    47>

In [14]:
df.describe

<bound method NDFrame.describe of       name  mark
A    kriti    78
B   annaya    76
C  anushka    89
D    krina    47>

In [15]:
df.head() #first five record

      name  mark
A    kriti    78
B   annaya    76
C  anushka    89
D    krina    47

In [16]:
df.head(2)

     name  mark
A   kriti    78
B  annaya    76

In [17]:
df.tail(2)

      name  mark
C  anushka    89
D    krina    47

In [50]:
import pandas as pd

In [60]:
df=pd.read_csv("new.csv")#import from excel and upload in jupyter notebook
df

     NAME  MARKS  AGE
0    king     88   21
1   queen     89   22
2   vajir     55   23
3  kishan     65   24

In [61]:
type(df)

pandas.core.frame.DataFrame

In [62]:
df.shape

(4, 3)

In [63]:
df.columns

Index(['NAME', 'MARKS', 'AGE'], dtype='object')

In [64]:
df.NAME

0      king
1     queen
2     vajir
3    kishan
Name: NAME, dtype: object

In [65]:
df.info

<bound method DataFrame.info of      NAME  MARKS  AGE
0    king     88   21
1   queen     89   22
2   vajir     55   23
3  kishan     65   24>

In [66]:
df.describe

<bound method NDFrame.describe of      NAME  MARKS  AGE
0    king     88   21
1   queen     89   22
2   vajir     55   23
3  kishan     65   24>

In [69]:
df.head(3)

    NAME  MARKS  AGE
0   king     88   21
1  queen     89   22
2  vajir     55   23

In [70]:
df[['NAME','MARKS']]

     NAME  MARKS
0    king     88
1   queen     89
2   vajir     55
3  kishan     65

In [71]:
df.iloc[3]

NAME     kishan
MARKS        65
AGE          24
Name: 3, dtype: object

In [72]:
df.iloc[1:3]

    NAME  MARKS  AGE
1  queen     89   22
2  vajir     55   23

In [73]:
df['MARKS2']=[45,50,55,60]
df

     NAME  MARKS  AGE  MARKS2
0    king     88   21      45
1   queen     89   22      50
2   vajir     55   23      55
3  kishan     65   24      60

In [76]:
df['total']=df['MARKS']+df['MARKS2']
df

     NAME  MARKS  AGE  MARKS2  tota;  total
0    king     88   21      45    133    133
1   queen     89   22      50    139    139
2   vajir     55   23      55    110    110
3  kishan     65   24      60    125    125

In [83]:
import pandas as pd

In [85]:
df2=df.rename(columns={"MARKS":"Java","AGE":"PYTHON"})
df2

     NAME  Java  PYTHON  MARKS2  tota;  total
0    king    88      21      45    133    133
1   queen    89      22      50    139    139
2   vajir    55      23      55    110    110
3  kishan    65      24      60    125    125